# 1.What will be the output of the following pytrhon program

In [1]:
def foo(x): #You have a function foo that takes a list x as an argument.
    x[0] = ['def']
    x[1] = ['abc']# replace the elements at these indices with lists containing the strings 'def' and 'abc', respectively.
    return id(x) #The function then returns the id of the modified list x.
q=['abc','def' ]#a list q initially containing the strings 'abc' and 'def'.
print(id(q)==foo(q))    #The comparison id(q) == foo(q) checks if the id of the original list q is equal to the id returned by the function.

True

# 2.What will be the output of the following pytrhon code

In [3]:
def fun():
    try:
        return 1#The try block contains a return 1 statement.
    finally:
        return 2#The finally block contains a return 1 statement.
k = fun()
print(k)
# In Python, when a finally block is present, it is always executed, regardless of whether an exception occurs in the try block or not. In your code

2

# 3.What will be the output of the following code snippet

In [4]:
def func():
    global value# value is initially set to "Global" outside the function.
    value="Local"#  value as a global variable using the global keyword and set its value to "Local."
value ="Global"
func()
print(value)#After the function call, the value of the global variable value is printed.

Local

#####  a global variable value initially set to "Global." The function func() is then defined to change the global variable value to "Local." Finally, the function is called, and the value of the global variable value is printed.

# 4.__ exceptions are raised as a result of an error in opening a particular file

### The exceptions that can be raised due to errors in opening a file are typically instances of the `FileNotFoundError` or `IOError class`.

## IOError in Python is an exception that is raised for input/output-related errors

# 5. In python we do not specify types, it is directly interpreted by the compiler, so consider the following operation to be performed

### a) x=13//2 `[ In the expression x = 13 // 2, the // operator is the floor division operator in Python. It divides the left operand by the right operand and returns the largest integer less than or equal to the result.]`
### b) x=int(13/2)`13/2 results in the floating-point number 6.5.int(6.5) converts the floating-point number to the integer 6`
### c) x=13%2`, the % operator is the modulus operator in Python. It returns the remainder when the left operand is divided by the right operand.`
### d) All of the mentioned

## So option d is correct

# 6.What will be the output of the following python code

In [5]:
t[5]# we get name error

NameError: name 't' is not defined

# 7.A while loop in python is used for what type of iteration

## ``It is used for indefinite ``

# 8.What will be the output of the following python code?

In [6]:
x='abcdef'
while i in x:
    print(i,end=" ")

NameError: name 'i' is not defined

# 9.What is the main advantage of using Decorators in python

### `They simplify the syntax of the decorated functions`

# 10.If the return statement is not used inside the function,the function will return:
## `None`

# 11.What is called when a function is defined inside a class?

# `Method`

# 12. Which operator is used in python to import modules from  packages?

# `The dot (.) operator is used to access modules or attributes within packages.`

# 13.What will be the output of the following python code?

In [12]:
def getMonth(m):# The getMonth function takes an argument m 
    if m<1 or m>12:#  checks if it is within the valid range of months (1 to 12, inclusive)
        raise ValueError("Invalid")# If the provided value is outside this range, a ValueError is raised with the message "Invalid."
    print(m)# the function prints the value of m.
getMonth(6)

6

# 14.In python programming Language syntax error is detected by __at __

# `interpreter` at `run time`

# 15

In [13]:
class Book:
    def __init__(self,author):
        self.author=author
book1=Book("V.M.Shah")
book2=book1

In [16]:
book1

In [17]:
book2

## `book2 equal to book1. This means that book2 now refers to the same object as book1.`

# ``` Module-Data Analysis ```

In [21]:
import pandas as pd

df = pd.DataFrame({
    'Date': pd.to_datetime(['2024-01-01', '2024-01-02', '2024-01-03', '2024-01-10', '2024-01-09', '2024-01-08']),
    'Category': ['Beverage', 'Food', 'Beverage', 'Beverage', 'Beverage', 'Food'],
    'Product': ['Cappuccino', 'Croissant', 'Espresso', 'Latte', 'Latte', 'Muffin'],
    'CustomerID': ['C004', 'C002', 'C001', 'C001', 'C003', 'C002'],
    'Quantity': [1, 2, 2, 3, 1, 1],
    'UnitPrice': [3, 2, 2, 3.5, 3.5, 2.5]
})
df

        Date  Category     Product CustomerID  Quantity  UnitPrice
0 2024-01-01  Beverage  Cappuccino       C004         1        3.0
1 2024-01-02      Food   Croissant       C002         2        2.0
2 2024-01-03  Beverage    Espresso       C001         2        2.0
3 2024-01-10  Beverage       Latte       C001         3        3.5
4 2024-01-09  Beverage       Latte       C003         1        3.5
5 2024-01-08      Food      Muffin       C002         1        2.5

# 16. How to create a new column 'Revenue', which has value equals to the Quantity * Unit price of the current row?

In [22]:
# Create a new column 'Revenue'
df['Revenue'] = df['Quantity'] * df['UnitPrice']
df['Revenue']

0     3.0
1     4.0
2     4.0
3    10.5
4     3.5
5     2.5
Name: Revenue, dtype: float64

In [23]:
df

        Date  Category     Product CustomerID  Quantity  UnitPrice  Revenue
0 2024-01-01  Beverage  Cappuccino       C004         1        3.0      3.0
1 2024-01-02      Food   Croissant       C002         2        2.0      4.0
2 2024-01-03  Beverage    Espresso       C001         2        2.0      4.0
3 2024-01-10  Beverage       Latte       C001         3        3.5     10.5
4 2024-01-09  Beverage       Latte       C003         1        3.5      3.5
5 2024-01-08      Food      Muffin       C002         1        2.5      2.5

# 17.What is the syntax to find the Categorical wise revenue?

In [28]:
x = df.groupby('Category')['Revenue'].sum()
x

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

In [30]:
import numpy as np
y = df.groupby('Category')['Revenue'].agg(np.sum)
y

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

In [31]:
z= df.groupby('Category')['Revenue'].agg('sum')
z

Category
Beverage    21.0
Food         6.5
Name: Revenue, dtype: float64

# 18.To find the average quantity wrt to date and product , what is the correct syntax?

In [32]:
df.groupby(['Date','Product'])['Quantity'].mean()

Date        Product
2024-01-01  Cappuccino    1.0
2024-01-02  Croissant     2.0
2024-01-03  Espresso      2.0
2024-01-08  Muffin        1.0
2024-01-09  Latte         1.0
2024-01-10  Latte         3.0
Name: Quantity, dtype: float64

# 19.Categorical wise revenue for Beverage and Food respectively are

In [33]:
beverage_revenue = df[df['Category'] == 'Beverage']['Revenue'].sum()
food_revenue = df[df['Category'] == 'Food']['Revenue'].sum()
print("Beverage Revenue:", beverage_revenue)
print("Food Revenue:", food_revenue)

Beverage Revenue: 21.0
Food Revenue: 6.5

# 20. Using transform, what is the syntax to create a column which has a UnitPrice difference wrt its Categorical mean?

In [35]:
df.groupby('Category')['UnitPrice'].transform(lambda x:x-x.mean())#  calculates the difference between each row's 'UnitPrice' and the mean 'UnitPrice' for its respective category.

0    0.00
1   -0.25
2   -1.00
3    0.50
4    0.50
5    0.25
Name: UnitPrice, dtype: float64

# 21. What is the correct syntax to get data wrt 'Monday'?

In [40]:
df.groupby(df.Date.dt.day_name()).get_group('Monday')# it checks if the day is monday

        Date  Category     Product CustomerID  Quantity  UnitPrice  Revenue
0 2024-01-01  Beverage  Cappuccino       C004         1        3.0      3.0
5 2024-01-08      Food      Muffin       C002         1        2.5      2.5

# 22.Which of the following statements is/are True?

### `apply() can be applied on rows`
### `Apply applies the function on the entrire series at a time`

# 23. Which of the following statements is/are True?

### `apply` and `map` provide vectorized operations, but apply is more versatile and applicable to both DataFrames and Series, while map is specific to Series and is often used for value substitution based on a mapping.

In [41]:
df1 = pd.DataFrame({
    'Date': ['2024-01-10', '2024-01-11', '2024-01-10', '2024-01-12', '2024-01-11', '2024-01-12'],
    'Region': ['North', 'South', 'East', 'West', 'North', 'East'],
    'Salesperson': ['Ajay', 'Balu', 'Chirag', 'Ajay', 'Balu', 'Chirag'],
    'Product': ['Notebook', 'Pen', 'Notebook', 'Pen', 'Binder', 'Binder'],
    'Quantity': ['5', '10', '7', '15', '20', '10'],
    'UnitPrice': ['12', '3', '12', '3', '5', '5']
})
df1

         Date Region Salesperson   Product Quantity UnitPrice
0  2024-01-10  North        Ajay  Notebook        5        12
1  2024-01-11  South        Balu       Pen       10         3
2  2024-01-10   East      Chirag  Notebook        7        12
3  2024-01-12   West        Ajay       Pen       15         3
4  2024-01-11  North        Balu    Binder       20         5
5  2024-01-12   East      Chirag    Binder       10         5

# 24.What is the syntax to create a pivot table with index as North and South and columns as product where the values are sum of Quantities sold?

In [52]:
x=df1[df1['Region'].isin(['North','South'])].pivot_table(index = 'Product',columns = 'Region',values='Quantity',aggfunc='sum')

In [53]:
x

Region   North South
Product
Binder      20   NaN
Notebook     5   NaN
Pen        NaN    10

# 25. Which of the folloewing statements is/are True?

### The` .loc` method in pandas and pass the default integer index when slicing. The .loc method is primarily label-based, but it allows you to use the default integer index when slicing as well.

# 26.Using a pivot table is it possible to create a mulyi-index dataframe, if so what is the syntax to have a multi indx of Date and Region , with total Productsold as values?

### `Yes, it's possible to create a multi-index DataFrame using a pivot table in pandas.`

In [54]:
a= df1.pivot_table(index=['Date','Region'],columns='Product',values='Quantity',aggfunc='sum')
a

Product           Binder Notebook  Pen
Date       Region
2024-01-10 East      NaN        7  NaN
           North     NaN        5  NaN
2024-01-11 North      20      NaN  NaN
           South     NaN      NaN   10
2024-01-12 East       10      NaN  NaN
           West      NaN      NaN   15

# 27. What does the margins parameter in the pivot_table()function allow you to include in the pivot table?

##### `The margins parameter in the pivot_table() function in pandas allows you to include a row and/or column that contains the total (or margin) values for each group in the pivot table.`

In [90]:
df2 = pd.DataFrame({
    'Fruits': ['apple', 'banana', 'apple', 'apple', 'banana', 'apple', 'kiwi', 'kiwi', 'banana', 'apple', 'kiwi', 'apple', 'banana', 'grape', 'apple', 'banana', 'apple', 'apple', 'grape'],
    'Price': ['', '', 205, 200, 40, 210, 300, 320, '', 180, 350, '', 35, '', 215, 40, '', '', '']
})
df2

    Fruits Price
0    apple
1   banana
2    apple   205
3    apple   200
4   banana    40
5    apple   210
6     kiwi   300
7     kiwi   320
8   banana
9    apple   180
10    kiwi   350
11   apple
12  banana    35
13   grape
14   apple   215
15  banana    40
16   apple
17   apple
18   grape

# 28. If we choose to impute missing values in Price col by chaining ffill() and bfill() while limiting the imputation to 1, 1 respectively, how many missing values will be left post imputation?

In [83]:
# Convert empty strings to NaN
df2['Price'] = pd.to_numeric(df2['Price'], errors='coerce')# Specifically, when errors is set to 'coerce', it means that, if any errors occur during the conversion, the corresponding elements will be replaced with NaN (Not a Number).
df2['Price'] = df2['Price'].ffill(limit=1).bfill(limit=1)
df2

    Fruits  Price
0    apple    NaN
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple    NaN
18   grape    NaN

In [84]:
remaining_missing_values = df2['Price'].isnull().sum()

In [85]:
remaining_missing_values

3

# 29. What kind of missing values handling technique is appropriate for df2

## `Imputing Price column with individual fruit's Price's median`

# 30. If we choose to impute missing values in Price col by with individual Fruits' Price's mean, how many missing values will be post imputation?

In [88]:
df2

    Fruits  Price
0    apple  200.0
1   banana  205.0
2    apple  205.0
3    apple  200.0
4   banana   40.0
5    apple  210.0
6     kiwi  300.0
7     kiwi  320.0
8   banana  320.0
9    apple  180.0
10    kiwi  350.0
11   apple  350.0
12  banana   35.0
13   grape   35.0
14   apple  215.0
15  banana   40.0
16   apple   40.0
17   apple  200.0
18   grape   35.0

In [92]:
df2['Price'] = pd.to_numeric(df2['Price'])#can only concatenate str (not "int") to str
df2['Price'] = df2.groupby('Fruits')['Price'].transform(lambda x: x.fillna(x.mean()))
df2

    Fruits       Price
0    apple  202.000000
1   banana   38.333333
2    apple  205.000000
3    apple  200.000000
4   banana   40.000000
5    apple  210.000000
6     kiwi  300.000000
7     kiwi  320.000000
8   banana   38.333333
9    apple  180.000000
10    kiwi  350.000000
11   apple  202.000000
12  banana   35.000000
13   grape         NaN
14   apple  215.000000
15  banana   40.000000
16   apple  202.000000
17   apple  202.000000
18   grape         NaN

### `There are 2 missing values after post imputation with the fruits mean`

# 31. If a = pd.Series([np.nan, 1,2, np.nan, np.nan,np.nan, np.nan, 4, 5, 7])
## What will be the output of a.interpolate()

In [93]:
 a = pd.Series([np.nan, 1,2, np.nan, np.nan,np.nan, np.nan, 4, 5, 7])

In [94]:
a

0    NaN
1    1.0
2    2.0
3    NaN
4    NaN
5    NaN
6    NaN
7    4.0
8    5.0
9    7.0
dtype: float64

In [95]:
a.interpolate()

0    NaN
1    1.0
2    2.0
3    2.4
4    2.8
5    3.2
6    3.6
7    4.0
8    5.0
9    7.0
dtype: float64

# 32.What is the use of the normalization parameter in the crosstab method of pandas?

## `It is used to normalize values by dividing them by the total count`